
* The following COBOL library item (.cob) is a "digital artifact" that contains
* lines of code in the COBOL programming language in, for example, the WORKING-STORAGE
* section of application programs written in COBOL that use SQL-implementations. 
*
* A typical inclusion is:
*
*    COPY SQLCLI.
*

    * SPECIAL LENGTH/INDICATOR VALUES
    01 SQL-NULL-DATA                         PIC S9(9) BINARY VALUE IS    -1.
    01 SQL-DATA-AT-EXEC                      PIC S9(9) BINARY VALUE IS    -2.
    * RETURN VALUES FROM FUNCTIONS
    01 SQL-SUCCESS                           PIC S9(4) BINARY VALUE IS     0.
    01 SQL-SUCCESS-WITH-INFO                 PIC S9(4) BINARY VALUE IS     1.
    01 SQL-NEED-DATA                         PIC S9(4) BINARY VALUE IS    99.
    01 SQL-NO-DATA                           PIC S9(4) BINARY VALUE IS   100.
    01 SQL-ERROR                             PIC S9(4) BINARY VALUE IS    -1.
    01 SQL-INVALID-HANDLE                    PIC S9(4) BINARY VALUE IS    -2.
    * ROW STATUS VALUES AFTER A CALL TO A FETCH FUNCTION
    01 SQL-ROW-SUCCESS                       PIC S9(4) BINARY VALUE IS     0.
    01 SQL-ROW-SUCCESS-WITH-INFO             PIC S9(4) BINARY VALUE IS     6.
    01 SQL-ROW-ERROR                         PIC S9(4) BINARY VALUE IS     5.
    01 SQL-ROW-NO-ROW                        PIC S9(4) BINARY VALUE IS     3.
    * FLAGS FOR NULL-TERMINATED STRING
    01 SQL-NTS                               PIC S9(4) BINARY VALUE IS    -3.
    01 SQL-NTSL                              PIC S9(9) BINARY VALUE IS    -3.
    * MAXIMUM MESSAGE LENGTH
    01 SQL-MAXIMUM-MESSAGE-LENGTH            PIC S9(4) BINARY VALUE IS   512.
    * ENVIRONMENT ATTRIBUTE
    01 SQL-ATTR-OUTPUT-NTS                   PIC S9(9) BINARY VALUE IS 10001.
    * CONNECTION ATTRIBUTE
    01 SQL-ATTR-AUTO-IPD                     PIC S9(9) BINARY VALUE IS 10001.
    01 SQL-ATTR-SAVEPOINT-NAME               PIC S9(9) BINARY VALUE IS 10027.
    * HANDLE TYPE IDENTIFIERS
    01 SQL-HANDLE-ENV                        PIC S9(4) BINARY VALUE IS     1.
    01 SQL-HANDLE-DBC                        PIC S9(4) BINARY VALUE IS     2.
    01 SQL-HANDLE-STMT                       PIC S9(4) BINARY VALUE IS     3.
    01 SQL-HANDLE-DESC                       PIC S9(4) BINARY VALUE IS     4.
    * STATEMENT ATTRIBUTES
    01 SQL-ATTR-CURSOR-SCROLLABLE            PIC S9(9) BINARY VALUE IS    -1.
    01 SQL-ATTR-CURSOR-SENSITIVITY           PIC S9(9) BINARY VALUE IS    -2.
    01 SQL-ATTR-CURSOR-HOLDABLE              PIC S9(9) BINARY VALUE IS    -3.
    01 SQL-ATTR-APP-ROW-DESC                 PIC S9(9) BINARY VALUE IS 10010.
    01 SQL-ATTR-APP-PARAM-DESC               PIC S9(9) BINARY VALUE IS 10011.
    01 SQL-ATTR-IMP-ROW-DESC                 PIC S9(9) BINARY VALUE IS 10012.
    01 SQL-ATTR-IMP-PARAM-DESC               PIC S9(9) BINARY VALUE IS 10013.
    01 SQL-ATTR-METADATA-ID                  PIC S9(9) BINARY VALUE IS 10014.
    01 SQL-ATTR-CURRENT-OF-POSITION          PIC S9(9) BINARY VALUE IS 10027.
    01 SQL-ATTR-NEST-DESCRIPTOR              PIC S9(9) BINARY VALUE IS 10029.
    * IDENTIFIERS OF FIELDS IN THE SQL/CLI ITEM DESCRIPTOR AREA
    01 SQL-DESC-ARRAY-SIZE                   PIC S9(4) BINARY VALUE IS    20.
    01 SQL-DESC-ARRAY-STATUS-POINTER         PIC S9(4) BINARY VALUE IS    21.
    01 SQL-DESC-DATETIME-INTERVAL-PRECISION  PIC S9(4) BINARY VALUE IS    26.
    01 SQL-DESC-ROWS-PROCESSED-POINTER       PIC S9(4) BINARY VALUE IS    34.
    01 SQL-DESC-COUNT                        PIC S9(4) BINARY VALUE IS  1001.
    01 SQL-DESC-TYPE                         PIC S9(4) BINARY VALUE IS  1002.
    01 SQL-DESC-LENGTH                       PIC S9(4) BINARY VALUE IS  1003.
    01 SQL-DESC-OCTET-LENGTH-POINTER         PIC S9(4) BINARY VALUE IS  1004.
    01 SQL-DESC-PRECISION                    PIC S9(4) BINARY VALUE IS  1005.
    01 SQL-DESC-SCALE                        PIC S9(4) BINARY VALUE IS  1006.
    01 SQL-DESC-DATETIME-INTERVAL-CODE       PIC S9(4) BINARY VALUE IS  1007.
    01 SQL-DESC-NULLABLE                     PIC S9(4) BINARY VALUE IS  1008.
    01 SQL-DESC-INDICATOR-POINTER            PIC S9(4) BINARY VALUE IS  1009.
    01 SQL-DESC-DATA-POINTER                 PIC S9(4) BINARY VALUE IS  1010.
    01 SQL-DESC-NAME                         PIC S9(4) BINARY VALUE IS  1011.
    01 SQL-DESC-UNNAMED                      PIC S9(4) BINARY VALUE IS  1012.
    01 SQL-DESC-OCTET-LENGTH                 PIC S9(4) BINARY VALUE IS  1013.
    01 SQL-DESC-COLLATION-CATALOG            PIC S9(4) BINARY VALUE IS  1015.
    01 SQL-DESC-COLLLATION-SCHEMA            PIC S9(4) BINARY VALUE IS  1016.
    01 SQL-DESC-COLLATION-NAME               PIC S9(4) BINARY VALUE IS  1017.
    01 SQL-DESC-CHARACTER-SET-CATALOG        PIC S9(4) BINARY VALUE IS  1018.
    01 SQL-DESC-CHARACTER-SET-SCHEMA         PIC S9(4) BINARY VALUE IS  1019.
    01 SQL-DESC-CHARACTER-SET-NAME           PIC S9(4) BINARY VALUE IS  1020.
    01 SQL-DESC-PARAMETER-MODE               PIC S9(4) BINARY VALUE IS  1021.
    01 SQL-DESC-PARAMETER-ORDINAL-POSITION   PIC S9(4) BINARY VALUE IS  1022.
    01 SQL-DESC-PARAMETER-SPECIFIC-CATALOG   PIC S9(4) BINARY VALUE IS  1023.
    01 SQL-DESC-PARAMETER-SPECIFIC-SCHEMA    PIC S9(4) BINARY VALUE IS  1024.
    01 SQL-DESC-PARAMETER-SPECIFIC-NAME      PIC S9(4) BINARY VALUE IS  1025.
    01 SQL-DESC-UDT-CATALOG                  PIC S9(4) BINARY VALUE IS  1026.
    01 SQL-DESC-UDT-SCHEMA                   PIC S9(4) BINARY VALUE IS  1027.
    01 SQL-DESC-UDT-NAME                     PIC S9(4) BINARY VALUE IS  1028.
    01 SQL-DESC-KEY-TYPE                     PIC S9(4) BINARY VALUE IS  1029.
    01 SQL-DESC-KEY-MEMBER                   PIC S9(4) BINARY VALUE IS  1030.
    01 SQL-DESC-DYNAMIC-FUNCTION             PIC S9(4) BINARY VALUE IS  1031.
    01 SQL-DESC-DYNAMIC-FUNCTION-CODE        PIC S9(4) BINARY VALUE IS  1032.
    01 SQL-DESC-SCOPE-CATALOG                PIC S9(4) BINARY VALUE IS  1033.
    01 SQL-DESC-SCOPE-SCHEMA                 PIC S9(4) BINARY VALUE IS  1034.
    01 SQL-DESC-SCOPE-NAME                   PIC S9(4) BINARY VALUE IS  1035.
    01 SQL-DESC-SPECIFIC-SCOPE-CATALOG       PIC S9(4) BINARY VALUE IS  1036.
    01 SQL-DESC-SPECIFIC-SCOPE-SCHEMA        PIC S9(4) BINARY VALUE IS  1037.
    01 SQL-DESC-SPECIFIC-SCOPE-NAME          PIC S9(4) BINARY VALUE IS  1038.
    01 SQL-DESC-CURRENT-TRANSFORM-GROUP      PIC S9(4) BINARY VALUE IS  1039.
    01 SQL-DESC-CARDINALITY                  PIC S9(4) BINARY VALUE IS  1040.
    01 SQL-DESC-DEGREE                       PIC S9(4) BINARY VALUE IS  1041.
    01 SQL-DESC-LEVEL                        PIC S9(4) BINARY VALUE IS  1042.
    01 SQL-DESC-RETURNED-CARDINALITY-POINTER PIC S9(4) BINARY VALUE IS  1043.
    01 SQL-DESC-TOP-LEVEL-COUNT              PIC S9(4) BINARY VALUE IS  1044.
    01 SQL-DESC-USER-DEFINED-TYPE-CODE       PIC S9(4) BINARY VALUE IS  1045.
    01 SQL-DESC-ALLOC-TYPE                   PIC S9(4) BINARY VALUE IS  1099.
    * IDENTIFIERS OF FIELDS IN THE DIAGNOSTICS AREA
    01 SQL-DIAG-ROW-NUMBER                   PIC S9(4) BINARY VALUE IS -1248.
    01 SQL-DIAG-COLUMN-NUMBER                PIC S9(4) BINARY VALUE IS -1247.
    01 SQL-DIAG-RETURNCODE                   PIC S9(4) BINARY VALUE IS     1.
    01 SQL-DIAG-NUMBER                       PIC S9(4) BINARY VALUE IS     2.
    01 SQL-DIAG-ROW-COUNT                    PIC S9(4) BINARY VALUE IS     3.
    01 SQL-DIAG-SQLSTATE                     PIC S9(4) BINARY VALUE IS     4.
    01 SQL-DIAG-NATIVE-CODE                  PIC S9(4) BINARY VALUE IS     5.
    01 SQL-DIAG-MESSAGE-TEXT                 PIC S9(4) BINARY VALUE IS     6.
    01 SQL-DIAG-DYNAMIC-FUNCTION             PIC S9(4) BINARY VALUE IS     7.
    01 SQL-DIAG-CLASS-ORIGIN                 PIC S9(4) BINARY VALUE IS     8.
    01 SQL-DIAG-SUBCLASS-ORIGIN              PIC S9(4) BINARY VALUE IS     9.
    01 SQL-DIAG-CONNECTION-NAME              PIC S9(4) BINARY VALUE IS    10.
    01 SQL-DIAG-SERVER-NAME                  PIC S9(4) BINARY VALUE IS    11.
    01 SQL-DIAG-DYNAMIC-FUNCTION-CODE        PIC S9(4) BINARY VALUE IS    12.
    01 SQL-DIAG-MORE                         PIC S9(4) BINARY VALUE IS    13.
    01 SQL-DIAG-CONDITION-NUMBER             PIC S9(4) BINARY VALUE IS    14.
    01 SQL-DIAG-CONSTRAINT-CATALOG           PIC S9(4) BINARY VALUE IS    15.
    01 SQL-DIAG-CONSTRAINT-SCHEMA            PIC S9(4) BINARY VALUE IS    16.
    01 SQL-DIAG-CONSTRAINT-NAME              PIC S9(4) BINARY VALUE IS    17.
    01 SQL-DIAG-CATALOG-NAME                 PIC S9(4) BINARY VALUE IS    18.
    01 SQL-DIAG-SCHEMA-NAME                  PIC S9(4) BINARY VALUE IS    19.
    01 SQL-DIAG-TABLE-NAME                   PIC S9(4) BINARY VALUE IS    20.
    01 SQL-DIAG-COLUMN-NAME                  PIC S9(4) BINARY VALUE IS    21.
    01 SQL-DIAG-CURSOR-NAME                  PIC S9(4) BINARY VALUE IS    22.
    01 SQL-DIAG-MESSAGE-LENGTH               PIC S9(4) BINARY VALUE IS    23.
    01 SQL-DIAG-MESSAGE-OCTET-LENGTH         PIC S9(4) BINARY VALUE IS    24.
    01 SQL-DIAG-CONDITION-IDENTIFIER         PIC S9(4) BINARY VALUE IS    25.
    01 SQL-DIAG-PARAMETER-NAME               PIC S9(4) BINARY VALUE IS    26.
    01 SQL-DIAG-ROUTINE-CATALOG              PIC S9(4) BINARY VALUE IS    27.
    01 SQL-DIAG-ROUTINE_SCHEMA               PIC S9(4) BINARY VALUE IS    28.
    01 SQL-DIAG-ROUTINE-NAME                 PIC S9(4) BINARY VALUE IS    29.
    01 SQL-DIAG-SPECIFIC-NAME                PIC S9(4) BINARY VALUE IS    30.
    01 SQL-DIAG-TRIGGER-CATALOG              PIC S9(4) BINARY VALUE IS    31.
    01 SQL-DIAG-TRIGGER-SCHEMA               PIC S9(4) BINARY VALUE IS    32.
    01 SQL-DIAG-TRIGGER-NAME                 PIC S9(4) BINARY VALUE IS    33.
    01 SQL-DIAG-TRANSACTIONS-COMMITTED       PIC S9(4) BINARY VALUE IS    34.
    01 SQL-DIAG-TRANSACTIONS-ROLLED-BACK     PIC S9(4) BINARY VALUE IS    35.
    01 SQL-DIAG-TRANSACTION-ACTIVE           PIC S9(4) BINARY VALUE IS    36.
    01 SQL-DIAG-PARAMETER-MODE               PIC S9(4) BINARY VALUE IS    37.
    01 SQL-DIAG-PARAMETER-ORDINAL-POSITION   PIC S9(4) BINARY VALUE IS    38.
    * DYNAMIC FUNCTION CODES RETURNED IN DIAGNOSTICS AREA
    01 SQL-DIAG-ALTER-DOMAIN                 PIC S9(9) BINARY VALUE IS     3.
    01 SQL-DIAG-ALTER-TABLE                  PIC S9(9) BINARY VALUE IS     4.
    01 SQL-DIAG-CALL                         PIC S9(9) BINARY VALUE IS     7.
    01 SQL-DIAG-CREATE-ASSERTION             PIC S9(9) BINARY VALUE IS     6.
    01 SQL-DIAG-CREATE-CHARACTER-SET         PIC S9(9) BINARY VALUE IS     8.
    01 SQL-DIAG-CREATE-COLLATION             PIC S9(9) BINARY VALUE IS    10.
    01 SQL-DIAG-CREATE-DOMAIN                PIC S9(9) BINARY VALUE IS    23.
    01 SQL-DIAG-CREATE-SCHEMA                PIC S9(9) BINARY VALUE IS    64.
    01 SQL-DIAG-CREATE-TABLE                 PIC S9(9) BINARY VALUE IS    77.
    01 SQL-DIAG-CREATE-TRANSLATION           PIC S9(9) BINARY VALUE IS    79.
    01 SQL-DIAG-CREATE-VIEW                  PIC S9(9) BINARY VALUE IS    84.
    01 SQL-DIAG-DELETE-WHERE                 PIC S9(9) BINARY VALUE IS    19.
    01 SQL-DIAG-DROP-ASSERTION               PIC S9(9) BINARY VALUE IS    24.
    01 SQL-DIAG-DROP-CHARACTER-SET           PIC S9(9) BINARY VALUE IS    25.
    01 SQL-DIAG-DROP-COLLATION               PIC S9(9) BINARY VALUE IS    26.
    01 SQL-DIAG-DROP-DOMAIN                  PIC S9(9) BINARY VALUE IS    27.
    01 SQL-DIAG-DROP-SCHEMA                  PIC S9(9) BINARY VALUE IS    31.
    01 SQL-DIAG-DROP-TABLE                   PIC S9(9) BINARY VALUE IS    32.
    01 SQL-DIAG-DROP-TRANSLATION             PIC S9(9) BINARY VALUE IS    33.
    01 SQL-DIAG-DROP-VIEW                    PIC S9(9) BINARY VALUE IS    36.
    01 SQL-DIAG-DYNAMIC-DELETE-CURSOR        PIC S9(9) BINARY VALUE IS    54.
    01 SQL-DIAG-DYNAMIC-UPDATE-CURSOR        PIC S9(9) BINARY VALUE IS    55.
    01 SQL-DIAG-GRANT                        PIC S9(9) BINARY VALUE IS    48.
    01 SQL-DIAG-INSERT                       PIC S9(9) BINARY VALUE IS    50.
    01 SQL-DIAG-MERGE                        PIC S9(9) BINARY VALUE IS   128.
    01 SQL-DIAG-REVOKE                       PIC S9(9) BINARY VALUE IS    59.
    01 SQL-DIAG-SELECT                       PIC S9(9) BINARY VALUE IS    41.
    01 SQL-DIAG-SELECT-CURSOR                PIC S9(9) BINARY VALUE IS    85.
    01 SQL-DIAG-SET-CATALOG                  PIC S9(9) BINARY VALUE IS    66.
    01 SQL-DIAG-SET-CONSTRAINT               PIC S9(9) BINARY VALUE IS    68.
    01 SQL-DIAG-SET-NAMES                    PIC S9(9) BINARY VALUE IS    72.
    01 SQL-DIAG-SET-SCHEMA                   PIC S9(9) BINARY VALUE IS    74.
    01 SQL-DIAG-SET-SESSION-AUTHORIZATION    PIC S9(9) BINARY VALUE IS    76.
    01 SQL-DIAG-SET-TIME-ZONE                PIC S9(9) BINARY VALUE IS    71.
    01 SQL-DIAG-SET-TRANSACTION              PIC S9(9) BINARY VALUE IS    75.
    01 SQL-DIAG-UNKNOWN-STATEMENT            PIC S9(9) BINARY VALUE IS     0.
    01 SQL-DIAG-UPDATE-WHERE                 PIC S9(9) BINARY VALUE IS    82.
    * SQL DATA TYPE CODES
    01 SQL-CHAR                              PIC S9(4) BINARY VALUE IS     1.
    01 SQL-NUMERIC                           PIC S9(4) BINARY VALUE IS     2.
    01 SQL-DECIMAL                           PIC S9(4) BINARY VALUE IS     3.
    01 SQL-INTEGER                           PIC S9(4) BINARY VALUE IS     4.
    01 SQL-SMALLINT                          PIC S9(4) BINARY VALUE IS     5.
    01 SQL-FLOAT                             PIC S9(4) BINARY VALUE IS     6.
    01 SQL-REAL                              PIC S9(4) BINARY VALUE IS     7.
    01 SQL-DOUBLE                            PIC S9(4) BINARY VALUE IS     8.
    01 SQL-DATETIME                          PIC S9(4) BINARY VALUE IS     9.
    01 SQL-INTERVAL                          PIC S9(4) BINARY VALUE IS    10.
    01 SQL-VARCHAR                           PIC S9(4) BINARY VALUE IS    12.
    01 SQL-BOOLEAN                           PIC S9(4) BINARY VALUE IS    16.
    01 SQL-UDT                               PIC S9(4) BINARY VALUE IS    17.
    01 SQL-UDT-LOCATOR                       PIC S9(4) BINARY VALUE IS    18.
    01 SQL-ROW                               PIC S9(4) BINARY VALUE IS    19.
    01 SQL-REF                               PIC S9(4) BINARY VALUE IS    20.
    01 SQL-BIGINT                            PIC S9(4) BINARY VALUE IS    25.
    01 SQL-BLOB                              PIC S9(4) BINARY VALUE IS    30.
    01 SQL-BLOB-LOCATOR                      PIC S9(4) BINARY VALUE IS    31.
    01 SQL-CLOB                              PIC S9(4) BINARY VALUE IS    40.
    01 SQL-CLOB-LOCATOR                      PIC S9(4) BINARY VALUE IS    41.
    01 SQL-ARRAY                             PIC S9(4) BINARY VALUE IS    50.
    01 SQL-ARRAY-LOCATOR                     PIC S9(4) BINARY VALUE IS    51.
    01 SQL-MULTISET                          PIC S9(4) BINARY VALUE IS    55.
    01 SQL-MULTISET-LOCATOR                  PIC S9(4) BINARY VALUE IS    56.
    *  CONCISE CODES FOR DATETIME AND INTERVAL DATA TYPES
    01 SQL-TYPE-DATE                         PIC S9(4) BINARY VALUE IS    91.
    01 SQL-TYPE-TIME                         PIC S9(4) BINARY VALUE IS    92.
    01 SQL-TYPE-TIME-WITH-TIMEZONE           PIC S9(4) BINARY VALUE IS    94.
    01 SQL-TYPE-TIMESTAMP                    PIC S9(4) BINARY VALUE IS    93.
    01 SQL-TYPE-TIMESTAMP-WITH-TIMEZONE      PIC S9(4) BINARY VALUE IS    95.
    01 SQL-INTERVAL-DAY                      PIC S9(4) BINARY VALUE IS   103.
    01 SQL-INTERVAL-DAY-TO-HOUR              PIC S9(4) BINARY VALUE IS   108.
    01 SQL-INTERVAL-DAY-TO-MINUTE            PIC S9(4) BINARY VALUE IS   109.
    01 SQL-INTERVAL-DAY-TO-SECOND            PIC S9(4) BINARY VALUE IS   112.
    01 SQL-INTERVAL-HOUR                     PIC S9(4) BINARY VALUE IS   104.
    01 SQL-INTERVAL-HOUR-TO-MINUTE           PIC S9(4) BINARY VALUE IS   111.
    01 SQL-INTERVAL-HOUR-TO-SECOND           PIC S9(4) BINARY VALUE IS   112.
    01 SQL-INTERVAL-MINUTE                   PIC S9(4) BINARY VALUE IS   105.
    01 SQL-INTERVAL-MINUTE-TO-SECOND         PIC S9(4) BINARY VALUE IS   113.
    01 SQL-INTERVAL-MONTH                    PIC S9(4) BINARY VALUE IS   102.
    01 SQL-INTERVAL-SECOND                   PIC S9(4) BINARY VALUE IS   106.
    01 SQL-INTERVAL-YEAR                     PIC S9(4) BINARY VALUE IS   101.
    01 SQL-INTERVAL-YEAR-TO-MONTH            PIC S9(4) BINARY VALUE IS   107.
    * USER-DEFINED DATA TYPE CODES
    01 SQL-DISTINCT                          PIC S9(4) BINARY VALUE IS     1.
    01 SQL-STRUCTURED                        PIC S9(4) BINARY VALUE IS     2.
    * SQLRGETTYPEINFO REQUEST FOR ALL DATA TYPES
    01 SQL-ALL-TYPES                         PIC S9(4) BINARY VALUE IS     0.
    *  SQLRBINDCOL AND SQLRBINDPARAMETER DEFAULT CONVERSION CODE
    01 SQL-DEFAULT                           PIC S9(4) BINARY VALUE IS    99.
    * SQLRGETDATA AND GETPARAMDATA CODES INDICATING THAT THE APPLICATION
    * DESCRIPTOR SPECIFIES THE DATA TYPE
    01 SQL-APD-TYPE                          PIC S9(4) BINARY VALUE IS   -99.
    01 SQL-ARD-TYPE                          PIC S9(4) BINARY VALUE IS   -99.
    * DATE/TIME TYPE SUBCODES
    01 SQL-CODE-DATE                         PIC S9(4) BINARY VALUE IS     1.
    01 SQL-CODE-TIME                         PIC S9(4) BINARY VALUE IS     2.
    01 SQL-CODE-TIMESTAMP                    PIC S9(4) BINARY VALUE IS     3.
    01 SQL-CODE-TIME-ZONE                    PIC S9(4) BINARY VALUE IS     4.
    01 SQL-CODE-TIMESTAMP-ZONE               PIC S9(4) BINARY VALUE IS     5.
    * INTERVAL QUALIFIER CODES
    01 SQL-DAY                               PIC S9(4) BINARY VALUE IS     3.
    01 SQL-DAY-TO-HOUR                       PIC S9(4) BINARY VALUE IS     8.
    01 SQL-DAY-TO-MINUTE                     PIC S9(4) BINARY VALUE IS     9.
    01 SQL-DAY-TO-SECOND                     PIC S9(4) BINARY VALUE IS    10.
    01 SQL-HOUR                              PIC S9(4) BINARY VALUE IS     4.
    01 SQL-HOUR-TO-MINUTE                    PIC S9(4) BINARY VALUE IS    11.
    01 SQL-HOUR-TO-SECOND                    PIC S9(4) BINARY VALUE IS    12.
    01 SQL-MINUTE                            PIC S9(4) BINARY VALUE IS     5.
    01 SQL-MINUTE-TO-SECOND                  PIC S9(4) BINARY VALUE IS    13.
    01 SQL-MONTH                             PIC S9(4) BINARY VALUE IS     2.
    01 SQL-SECOND                            PIC S9(4) BINARY VALUE IS     6.
    01 SQL-YEAR                              PIC S9(4) BINARY VALUE IS     1.
    01 SQL-YEAR-TO-MONTH                     PIC S9(4) BINARY VALUE IS     7.
    * CLI OPTION VALUES
    01 SQL-FALSE                             PIC S9(4) BINARY VALUE IS     0.
    01 SQL-FALSEL                            PIC S9(9) BINARY VALUE IS     0.
    01 SQL-TRUE                              PIC S9(4) BINARY VALUE IS     1.
    01 SQL-TRUEL                             PIC S9(9) BINARY VALUE IS     1.
    01 SQL-NONSCROLLABLE                     PIC S9(9) BINARY VALUE IS     0.
    01 SQL-SCROLLABLE                        PIC S9(9) BINARY VALUE IS     1.
    01 SQL-NONHOLDABLE                       PIC S9(9) BINARY VALUE IS     0.
    01 SQL-HOLDABLE                          PIC S9(9) BINARY VALUE IS     1.
    01 SQL-INITIALLY-DEFERRED                PIC S9(9) BINARY VALUE IS     5.
    01 SQL-INITIALLY-IMMEDIATE               PIC S9(9) BINARY VALUE IS     6.
    01 SQL-NOT-DEFERRABLE                    PIC S9(9) BINARY VALUE IS     7.
    * PARAMETER MODE VALUES
    01 SQL-PARAM-MODE-IN                     PIC S9(4) BINARY VALUE IS     1.
    01 SQL-PARAM-MODE-OUT                    PIC S9(4) BINARY VALUE IS     4.
    01 SQL-PARAM-MODE-INOUT                  PIC S9(4) BINARY VALUE IS     2.
    * CODES USED FOR FETCHORIENTATION
    01 SQL-FETCH-NEXT                        PIC S9(4) BINARY VALUE IS     1.
    01 SQL-FETCH-FIRST                       PIC S9(4) BINARY VALUE IS     2.
    01 SQL-FETCH-LAST                        PIC S9(4) BINARY VALUE IS     3.
    01 SQL-FETCH-PRIOR                       PIC S9(4) BINARY VALUE IS     4.
    01 SQL-FETCH-ABSOLUTE                    PIC S9(4) BINARY VALUE IS     5.
    01 SQL-FETCH-RELATIVE                    PIC S9(4) BINARY VALUE IS     6.
    * VALUES OF NULLABLE FIELD IN DESCRIPTOR
    01 SQL-NO-NULLS                          PIC S9(4) BINARY VALUE IS     0.
    01 SQL-NULLABLE                          PIC S9(4) BINARY VALUE IS     1.
    * VALUES RETURNED BY SQLRGETTYPEINFO FOR THE SEARCHABLE COLUMN
    01 SQL-PRED-NONE                         PIC S9(4) BINARY VALUE IS     0.
    01 SQL-PRED-CHAR                         PIC S9(4) BINARY VALUE IS     1.
    01 SQL-PRED-BASIC                        PIC S9(4) BINARY VALUE IS     2.
    * VALUES OF UNNAMED FIELD IN DESCRIPTOR
    01 SQL-NAMED                             PIC S9(4) BINARY VALUE IS     0.
    01 SQL-UNNAMED                           PIC S9(4) BINARY VALUE IS     1.
    * VALUES OF ALLOC-TYPE FIELD IN DESCRIPTOR
    01 SQL-DESC-ALLOC-AUTO                   PIC S9(4) BINARY VALUE IS     1.
    01 SQL-DESC-ALLOC-USER                   PIC S9(4) BINARY VALUE IS     2.
    * SQLRENDTRAN OPTIONS
    01 SQL-COMMIT                            PIC S9(4) BINARY VALUE IS     0.
    01 SQL-ROLLBACK                          PIC S9(4) BINARY VALUE IS     1.
    01 SQL-SAVEPOINT-NAME-ROLLBACK           PIC S9(4) BINARY VALUE IS     2.
    01 SQL-SAVEPOINT-NAME-RELEASE            PIC S9(4) BINARY VALUE IS     4.
    01 SQL-COMMIT-AND-CHAIN                  PIC S9(4) BINARY VALUE IS     6.
    01 SQL-ROLLBACK-AND-CHAIN                PIC S9(4) BINARY VALUE IS     7.
    * SQLRFREESTMT OPTIONS
    01 SQL-CLOSE-CURSOR                      PIC S9(4) BINARY VALUE IS     0.
    01 SQL-FREE-HANDLE                       PIC S9(4) BINARY VALUE IS     1.
    01 SQL-UNBIND-COLUMNS                    PIC S9(4) BINARY VALUE IS     2.
    01 SQL-UNBIND-PARAMETERS                 PIC S9(4) BINARY VALUE IS     3.
    01 SQL-REALLOCATE                        PIC S9(4) BINARY VALUE IS     4.
    * PROVIDED FOR BACKWARDS COMPABILITY
    01 SQL-CLOSE                             PIC S9(4) BINARY VALUE IS     0.
    01 SQL-DROP                              PIC S9(4) BINARY VALUE IS     1.
    01 SQL-UNBIND                            PIC S9(4) BINARY VALUE IS     2.
    01 SQL-RESET-PARAMS                      PIC S9(4) BINARY VALUE IS     3.
    * NULL HANDLE USED WHEN ALLOCATING HENV
    01 SQL-NULL-HANDLE                       PIC S9(9) BINARY VALUE IS     0.
    * NULL HANDLES RETURNED BY SQLRALLOCHANDLE
    01 SQL-NULL-HENV                         PIC S9(9) BINARY VALUE IS     0.
    01 SQL-NULL-HDBC                         PIC S9(9) BINARY VALUE IS     0.
    01 SQL-NULL-HSTMT                        PIC S9(9) BINARY VALUE IS     0.
    01 SQL-NULL-HDESC                        PIC S9(9) BINARY VALUE IS     0.
    * SQLRGETFUNCTIONS VALUES TO IDENTIFY CLI ROUTINES
    01 SQL-API-SQLALLOCCONNECT               PIC S9(4) BINARY VALUE IS     1.
    01 SQL-API-SQLALLOCENV                   PIC S9(4) BINARY VALUE IS     2.
    01 SQL-API-SQLALLOCHANDLE                PIC S9(4) BINARY VALUE IS  1001.
    01 SQL-API-SQLALLOCSTMT                  PIC S9(4) BINARY VALUE IS     3.
    01 SQL-API-SQLBINDCOL                    PIC S9(4) BINARY VALUE IS     4.
    01 SQL-API-SQLBINDPARAMETER              PIC S9(4) BINARY VALUE IS    72.
    01 SQL-API-SQLCANCEL                     PIC S9(4) BINARY VALUE IS     5.
    01 SQL-API-SQLCLOSECURSOR                PIC S9(4) BINARY VALUE IS  1003.
    01 SQL-API-SQLCOLATTRIBUTE               PIC S9(4) BINARY VALUE IS     6.
    01 SQL-API-SQLCOLUMNPRIVILEGES           PIC S9(4) BINARY VALUE IS    56.
    01 SQL-API-SQLCOLUMNS                    PIC S9(4) BINARY VALUE IS    40.
    01 SQL-API-SQLCONNECT                    PIC S9(4) BINARY VALUE IS     7.
    01 SQL-API-SQLCOPYDESC                   PIC S9(4) BINARY VALUE IS  1004.
    01 SQL-API-SQLDATASOURCES                PIC S9(4) BINARY VALUE IS    57.
    01 SQL-API-SQLDESCRIBECOL                PIC S9(4) BINARY VALUE IS     8.
    01 SQL-API-SQLDISCONNECT                 PIC S9(4) BINARY VALUE IS     9.
    01 SQL-API-SQLENDTRAN                    PIC S9(4) BINARY VALUE IS  1005.
    01 SQL-API-SQLERROR                      PIC S9(4) BINARY VALUE IS    10.
    01 SQL-API-SQLEXECDIRECT                 PIC S9(4) BINARY VALUE IS    11.
    01 SQL-API-SQLEXECUTE                    PIC S9(4) BINARY VALUE IS    12.
    01 SQL-API-SQLFETCH                      PIC S9(4) BINARY VALUE IS    13.
    01 SQL-API-SQLFETCHSCROLL                PIC S9(4) BINARY VALUE IS  1021.
    01 SQL-API-SQLFOREIGNKEYS                PIC S9(4) BINARY VALUE IS    60.
    01 SQL-API-SQLFREECONNECT                PIC S9(4) BINARY VALUE IS    14.
    01 SQL-API-SQLFREEENV                    PIC S9(4) BINARY VALUE IS    15.
    01 SQL-API-SQLFREEHANDLE                 PIC S9(4) BINARY VALUE IS  1006.
    01 SQL-API-SQLFREESTMT                   PIC S9(4) BINARY VALUE IS    16.
    01 SQL-API-SQLGETCONNECTATTR             PIC S9(4) BINARY VALUE IS  1007.
    01 SQL-API-SQLGETCURSORNAME              PIC S9(4) BINARY VALUE IS    17.
    01 SQL-API-SQLGETDATA                    PIC S9(4) BINARY VALUE IS    43.
    01 SQL-API-SQLGETDESCFIELD               PIC S9(4) BINARY VALUE IS  1008.
    01 SQL-API-SQLGETDESCREC                 PIC S9(4) BINARY VALUE IS  1009.
    01 SQL-API-SQLGETDIAGFIELD               PIC S9(4) BINARY VALUE IS  1010.
    01 SQL-API-SQLGETDIAGREC                 PIC S9(4) BINARY VALUE IS  1011.
    01 SQL-API-SQLGETENVATTR                 PIC S9(4) BINARY VALUE IS  1012.
    01 SQL-API-SQLGETFEATUREINFO             PIC S9(4) BINARY VALUE IS  1027.
    01 SQL-API-SQLGETFUNCTIONS               PIC S9(4) BINARY VALUE IS    44.
    01 SQL-API-SQLGETINFO                    PIC S9(4) BINARY VALUE IS    45.
    01 SQL-API-SQLGETLENGTH                  PIC S9(4) BINARY VALUE IS  1022.
    01 SQL-API-SQLGETPARAMDATA               PIC S9(4) BINARY VALUE IS  1025.
    01 SQL-API-SQLGETPOSITION                PIC S9(4) BINARY VALUE IS  1023.
    01 SQL-API-SQLGETSESSIONINFO             PIC S9(4) BINARY VALUE IS  1028.
    01 SQL-API-SQLGETSTMTATTR                PIC S9(4) BINARY VALUE IS  1014.
    01 SQL-API-SQLGETSUBSTRING               PIC S9(4) BINARY VALUE IS  1024.
    01 SQL-API-SQLGETTYPEINFO                PIC S9(4) BINARY VALUE IS    47.
    01 SQL-API-SQLMORERESULTS                PIC S9(4) BINARY VALUE IS    61.
    01 SQL-API-SQLNEXTRESULT                 PIC S9(4) BINARY VALUE IS    73.
    01 SQL-API-SQLNUMRESULTCOLS              PIC S9(4) BINARY VALUE IS    18.
    01 SQL-API-SQLPARAMDATA                  PIC S9(4) BINARY VALUE IS    48.
    01 SQL-API-SQLPREPARE                    PIC S9(4) BINARY VALUE IS    19.
    01 SQL-API-SQLPRIMARYKEYS                PIC S9(4) BINARY VALUE IS    65.
    01 SQL-API-SQLPUTDATA                    PIC S9(4) BINARY VALUE IS    49.
    01 SQL-API-SQLROWCOUNT                   PIC S9(4) BINARY VALUE IS    20.
    01 SQL-API-SQLSETCONNECTATTR             PIC S9(4) BINARY VALUE IS  1016.
    01 SQL-API-SQLSETCURSORNAME              PIC S9(4) BINARY VALUE IS    21.
    01 SQL-API-SQLSETDESCFIELD               PIC S9(4) BINARY VALUE IS  1017.
    01 SQL-API-SQLSETDESCREC                 PIC S9(4) BINARY VALUE IS  1018.
    01 SQL-API-SQLSETENVATTR                 PIC S9(4) BINARY VALUE IS  1019.
    01 SQL-API-SQLSETSTMTATTR                PIC S9(4) BINARY VALUE IS  1020.
    01 SQL-API-SQLSPECIALCOLUMNS             PIC S9(4) BINARY VALUE IS    52.
    01 SQL-API-SQLSTARTTRAN                  PIC S9(4) BINARY VALUE IS    74.
    01 SQL-API-SQLTABLES                     PIC S9(4) BINARY VALUE IS    54.
    01 SQL-API-SQLTABLEPRIVILEGES            PIC S9(4) BINARY VALUE IS    70.
    * INFORMATION REQUESTED BY SQLRGETINFO
    01 SQL-MAXIMUM-DRIVER-CONNECTIONS        PIC S9(4) BINARY VALUE IS     0.
    01 SQL-MAXIMUM-CONCURRENT-ACTIVITIES     PIC S9(4) BINARY VALUE IS     1.
    01 SQL-DATA-SOURCE-NAME                  PIC S9(4) BINARY VALUE IS     2.
    01 SQL-FETCH-DIRECTION                   PIC S9(4) BINARY VALUE IS     8.
    01 SQL-SERVER-NAME                       PIC S9(4) BINARY VALUE IS    13.
    01 SQL-SEARCH-PATTERN-ESCAPE             PIC S9(4) BINARY VALUE IS    14.
    01 SQL-DBMS-NAME                         PIC S9(4) BINARY VALUE IS    17.
    01 SQL-DBMS-VERSION                      PIC S9(4) BINARY VALUE IS    18.
    01 SQL-CURSOR-COMMIT-BEHAVIOR            PIC S9(4) BINARY VALUE IS    23.
    01 SQL-DATA-SOURCE-READ-ONLY             PIC S9(4) BINARY VALUE IS    25.
    01 SQL-DEFAULT-TRANSACTION-ISOLATION     PIC S9(4) BINARY VALUE IS    26.
    01 SQL-IDENTIFIER-CASE                   PIC S9(4) BINARY VALUE IS    28.
    01 SQL-MAXIMUM-COLUMN-NAME-LENGTH        PIC S9(4) BINARY VALUE IS    30.
    01 SQL-MAXIMUM-CURSOR-NAME-LENGTH        PIC S9(4) BINARY VALUE IS    31.
    01 SQL-MAXIMUM-SCHEMA-NAME-LENGTH        PIC S9(4) BINARY VALUE IS    32.
    01 SQL-MAXIMUM-CATALOG-NAME-LENGTH       PIC S9(4) BINARY VALUE IS    34.
    01 SQL-MAXIMUM-TABLE-NAME-LENGTH         PIC S9(4) BINARY VALUE IS    35.
    01 SQL-SCROLL-CONCURRENCY                PIC S9(4) BINARY VALUE IS    43.
    01 SQL-TRANSACTION-CAPABLE               PIC S9(4) BINARY VALUE IS    46.
    01 SQL-USER-NAME                         PIC S9(4) BINARY VALUE IS    47.
    01 SQL-TRANSACTION-ISOLATION-OPTION      PIC S9(4) BINARY VALUE IS    72.
    01 SQL-INTEGRITY                         PIC S9(4) BINARY VALUE IS    73.
    01 SQL-GETDATA-EXTENSIONS                PIC S9(4) BINARY VALUE IS    81.
    01 SQL-NULL-COLLATION                    PIC S9(4) BINARY VALUE IS    85.
    01 SQL-ALTER-TABLE                       PIC S9(4) BINARY VALUE IS    86.
    01 SQL-ORDER-BY-COLUMNS-IN-SELECT        PIC S9(4) BINARY VALUE IS    90.
    01 SQL-SPECIAL-CHARACTERS                PIC S9(4) BINARY VALUE IS    94.
    01 SQL-MAXIMUM-COLUMNS-IN-GROUP-BY       PIC S9(4) BINARY VALUE IS    97.
    01 SQL-MAXIMUM-COLUMNS-IN-ORDER-BY       PIC S9(4) BINARY VALUE IS    99.
    01 SQL-MAXIMUM-COLUMNS-IN-SELECT         PIC S9(4) BINARY VALUE IS   100.
    01 SQL-MAXIMUM-COLUMNS-IN-TABLE          PIC S9(4) BINARY VALUE IS   101.
    01 SQL-MAXIMUM-STMT-OCTETS               PIC S9(4) BINARY VALUE IS 20000.
    01 SQL-MAXIMUM-STMT-OCTETS-DATA          PIC S9(4) BINARY VALUE IS 20001.
    01 SQL-MAXIMUM-STMT-OCTETS-SCHEMA        PIC S9(4) BINARY VALUE IS 20002.
    01 SQL-MAXIMUM-TABLES-IN-SELECT          PIC S9(4) BINARY VALUE IS   106.
    01 SQL-MAXIMUM-USER-NAME-LENGTH          PIC S9(4) BINARY VALUE IS   107.
    01 SQL-OUTER-JOIN-CAPABILITIES           PIC S9(4) BINARY VALUE IS   115.
    01 SQL-CURSOR-SENSITIVITY                PIC S9(4) BINARY VALUE IS 10001.
    01 SQL-DESCRIBE-PARAMETER                PIC S9(4) BINARY VALUE IS 10002.
    01 SQL-CATALOG-NAME                      PIC S9(4) BINARY VALUE IS 10003.
    01 SQL-COLLATING-SEQUENCE                PIC S9(4) BINARY VALUE IS 10004.
    01 SQL-MAXIMUM-IDENTIFIER-LENGTH         PIC S9(4) BINARY VALUE IS 10005.
    * INFORMATION REQUESTED BY SQLRGETSESSIONINFO
    01 SQL-CURRENT-USER                      PIC S9(4) BINARY VALUE IS    47.
    01 SQL-CURRENT-DEFAULT-TRANSFORM-GROUP   PIC S9(4) BINARY VALUE IS 20004.
    01 SQL-CURRENT-PATH                      PIC S9(4) BINARY VALUE IS 20005.
    01 SQL-CURRENT-ROLE                      PIC S9(4) BINARY VALUE IS 20006.
    01 SQL-SESSION-USER                      PIC S9(4) BINARY VALUE IS 20007.
    01 SQL-SYSTEM-USER                       PIC S9(4) BINARY VALUE IS 20008.
    01 SQL-CURRENT-CATALOG                   PIC S9(4) BINARY VALUE IS 20009.
    01 SQL-CURRENT-SCHEMA                    PIC S9(4) BINARY VALUE IS 20010.
    * STATEMENT ATTRIBUTE VALUES FOR CURSOR SENSITIVITY
    01 SQL-ASENSITIVE                        PIC S9(9) BINARY VALUE IS     0.
    01 SQL-INSENSITIVE                       PIC S9(9) BINARY VALUE IS     1.
    01 SQL-SENSITIVE                         PIC S9(9) BINARY VALUE IS     2.
    * DEFINE SQL-UNSPECIFIED FOR BACKWARDS COMPATIBILITY
    01 SQL-UNSPECIFIED                       PIC S9(9) BINARY VALUE IS     0.
    * SQL-ALTER-TABLE VALUES
    01 SQL-AT-ADD-COLUMN                     PIC S9(9) BINARY VALUE IS     1.
    01 SQL-AT-DROP-COLUMN                    PIC S9(9) BINARY VALUE IS     2.
    01 SQL-AT-ALTER-COLUMN                   PIC S9(9) BINARY VALUE IS     4.
    01 SQL-AT-ADD-CONSTRAINT                 PIC S9(9) BINARY VALUE IS     8.
    01 SQL-AT-DROP-CONSTRAINT                PIC S9(9) BINARY VALUE IS    16.
    * SQL-CURSOR-COMMIT-BEHAVIOR VALUES
    01 SQL-CB-DELETE                         PIC S9(4) BINARY VALUE IS     0.
    01 SQL-CB-CLOSE                          PIC S9(4) BINARY VALUE IS     1.
    01 SQL-CB-PRESERVE                       PIC S9(4) BINARY VALUE IS     2.
    * SQL-FETCH-DIRECTION VALUES
    01 SQL-FD-FETCH-NEXT                     PIC S9(9) BINARY VALUE IS     1.
    01 SQL-FD-FETCH-FIRST                    PIC S9(9) BINARY VALUE IS     2.
    01 SQL-FD-FETCH-LAST                     PIC S9(9) BINARY VALUE IS     4.
    01 SQL-FD-FETCH-PRIOR                    PIC S9(9) BINARY VALUE IS     8.
    01 SQL-FD-FETCH-ABSOLUTE                 PIC S9(9) BINARY VALUE IS    16.
    01 SQL-FD-FETCH-RELATIVE                 PIC S9(9) BINARY VALUE IS    32.
    * SQL-GETDATA-EXTENSIONS VALUES
    01 SQL-GD-ANY-COLUMNS                    PIC S9(9) BINARY VALUE IS     1.
    01 SQL-GD-ANY-ORDER                      PIC S9(9) BINARY VALUE IS     2.
    * SQL-IDENTIFIER-CASE VALUES
    01 SQL-IC-UPPER                          PIC S9(4) BINARY VALUE IS     1.
    01 SQL-IC-LOWER                          PIC S9(4) BINARY VALUE IS     2.
    01 SQL-IC-SENSITIVE                      PIC S9(4) BINARY VALUE IS     3.
    01 SQL-IC-MIXED                          PIC S9(4) BINARY VALUE IS     4.
    * SQL-NULL-COLLATION VALUES
    01 SQL-NC-HIGH                           PIC S9(4) BINARY VALUE IS     1.
    01 SQL-NC-LOW                            PIC S9(4) BINARY VALUE IS     2.
    * SQL-OUTER-JOIN-CAPABILITIES VALUES
    01 SQL-OUTER-JOIN-LEFT                   PIC S9(9) BINARY VALUE IS     1.
    01 SQL-OUTER-JOIN-RIGHT                  PIC S9(9) BINARY VALUE IS     2.
    01 SQL-OUTER-JOIN-FULL                   PIC S9(9) BINARY VALUE IS     4.
    01 SQL-OUTER-JOIN-NESTED                 PIC S9(9) BINARY VALUE IS     8.
    01 SQL-OUTER-JOIN-NOT-ORDERED            PIC S9(9) BINARY VALUE IS    16.
    01 SQL-OUTER-JOIN-INNER                  PIC S9(9) BINARY VALUE IS    32.
    01 SQL-OUTER-JOIN-ALL-COMPARISON-OPS     PIC S9(9) BINARY VALUE IS    64.
    * SQL-SCROLL-CONCURRENCY VALUES
    01 SQL-SCCO-READ-ONLY                    PIC S9(9) BINARY VALUE IS     1.
    01 SQL-SCCO-LOCK                         PIC S9(9) BINARY VALUE IS     2.
    01 SQL-SCCO-OPT-ROWVER                   PIC S9(9) BINARY VALUE IS     4.
    01 SQL-SCCO-OPT-VALUES                   PIC S9(9) BINARY VALUE IS     8.
    * SQL-TRANSACTION-CAPABLE VALUES
    01 SQL-TC-NONE                           PIC S9(4) BINARY VALUE IS     0.
    01 SQL-TC-DML                            PIC S9(4) BINARY VALUE IS     1.
    01 SQL-TC-ALL                            PIC S9(4) BINARY VALUE IS     2.
    01 SQL-TC-ALL-COMMIT                     PIC S9(4) BINARY VALUE IS     3.
    01 SQL-TC-DDL-IGNORE                     PIC S9(4) BINARY VALUE IS     4.
    * SQL-TRANSACTION-ISOLATION VALUES
    01 SQL-TRANSACTION-READ-UNCOMMITTED      PIC S9(9) BINARY VALUE IS     1.
    01 SQL-TRANSACTION-READ-COMMITTED        PIC S9(9) BINARY VALUE IS     2.
    01 SQL-TRANSACTION-REPEATABLE-READ       PIC S9(9) BINARY VALUE IS     4.
    01 SQL-TRANSACTION-SERIALIZABLE          PIC S9(9) BINARY VALUE IS     8.
    * SQL-TRANSACTION-ACCESS-MODE VALUES
    01 SQL-TRANSACTION-READ-ONLY             PIC S9(9) BINARY VALUE IS     1.
    01 SQL-TRANSACTION-READ-WRITE            PIC S9(9) BINARY VALUE IS     2.
    * COLUMN TYPES AND SCOPES IN SPECIALCOLUMNS
    01 SQL-BEST-ROWID                        PIC S9(4) BINARY VALUE IS     1.
    01 SQL-SCOPE-CURRROW                     PIC S9(4) BINARY VALUE IS     0.
    01 SQL-SCOPE-TRANSACTION                 PIC S9(4) BINARY VALUE IS     1.
    01 SQL-SCOPE-SESSION                     PIC S9(4) BINARY VALUE IS     2.
    01 SQL-PC-UNKNOWN                        PIC S9(4) BINARY VALUE IS     0.
    01 SQL-PC-NOT-PSEUDO                     PIC S9(4) BINARY VALUE IS     1.
    01 SQL-PC-PSEUDO                         PIC S9(4) BINARY VALUE IS     2.
    * FOREIGN KEY UPDATE AND DELETE RULES
    01 SQL-CASCADE                           PIC S9(4) BINARY VALUE IS     0.
    01 SQL-RESTRICT                          PIC S9(4) BINARY VALUE IS     1.
    01 SQL-SET-NULL                          PIC S9(4) BINARY VALUE IS     2.
    01 SQL-NO-ACTION                         PIC S9(4) BINARY VALUE IS     3.
    01 SQL-SET-DEFAULT                       PIC S9(4) BINARY VALUE IS     4.
    * SPECIAL PARAMETER VALUES
    01 SQL-ALL-CATALOGS                                PIC X  VALUE IS   %.
    01 SQL-ALL-SCHEMAS                                 PIC X  VALUE IS   %.
    01 SQL-ALL-TABLE-TYPES                             PIC X  VALUE IS   %.
